import pandas as pd

# Создаем пустую адресную книгу с нужными колонками
df = pd.DataFrame(columns=["ФИО","Адрес","Телефон","Дата рождения"])
print("Привет! Давай создадим твою первую запись в адресной книге.")
# Добавление записи
print("\n[Шаг 1: Добавление новой записи]")#\n новая строка
fio = input("Пожалуйста, введи ФИО: ")
adr = input("Введи адрес проживания: ")
tel = input("Введи номер телефона: ")
dr = input("Введи дату рождения: ")
df.loc[len(df)] = [fio, adr, tel, dr]
print("Отлично! Запись успешно добавлена в таблицу.")
#Изменение записи
print("\n[Шаг 2: Изменение записи]")
print("Давайте обновим данные для этой записи. если вы не хотите обновлять определеннуюзапись то введите теже самые данные")
df.at[0, "ФИО"] = input("Введите новое ФИО: ")
df.at[0, "Адрес"] = input("Введите новый адрес: ")
df.at[0, "Телефон"] = input("Введите новый телефон: ")
df.at[0, "Дата рождения"] = input("Введите новую дату рождения: ")
print("Готово! Данные успешно изменены.")
#Показываем результат в консоли
print("\nВот как твоя адресная книга выглядит сейчас в консоли:")
print(df)
print("\n[Шаг 3: Удаление записи]")
fio_del = input("пожалуйста, введите точное ФИО записи, которую нужно удалить: ")
df = df[df["ФИО"] != fio_del]
print("Выполнено! Если такое ФИО было, мы его удалили.")
adr_del = input("пожалуйста, введите точный адрес записи, которую нужно удалить: ")
df = df[df["Адрес"] != fio_del]
print("Выполнено! Если такое ФИО было, мы его удалили.")
tel_del = input("пожалуйста, введите точный телефон записи, которую нужно удалить: ")
df = df[df["Телефон"] != fio_del]
print("Выполнено! Если такое ФИО было, мы его удалили.")
dr_del = input("пожалуйста, введите точную дату рождения записи, которую нужно удалить: ")
df = df[df["Дата рождения"] != fio_del]
print("Выполнено! Если такое ФИО было, мы его удалили.")
#Итоговый вывод измененных данных в самом конце (как просили в условии — вывод в консоль)
print("\n[Конец работы] Вот итоговый вид твоей адресной книги со всеми изменениями:")
print(df)
print("\nПрограмма завершена. Хорошего дня!")