import numpy as np
#исходные данные матрицы
a=int(input("пожалуйста, ведите количество строк:"))
b=int(input("пожалуйста, введите количество столбцов:"))
c=np.random.randint(1, 10, size=(a, b))
#создание матрицы
print("Исходная матрица:")
print(c)
#вывод
v = c.T 
#транспонированная матрица
print("Транспонированная матрица:")
print(v)
#вывод
if a == b:
    #проверка на то квадратная ли матрица
    det1=np.linalg.det(c)
     # определитель нетранспонированной
    det2 = np.linalg.det(v)
     # определитель транспонированной
    print("Определитель исходной матрицы:", det1)
    #вывод
    print("Определитель транспонированной матрицы:", det2)
    #вывод
    if det1 == det2:
        #сравнение матриц
        print("Определители равны ")
        #вывод
    else:
        print("Определители разные ")
        #вывод
else:
    print("извините, нельзя посчитать опредилитель")
    #если матрица не квадратная